NTR/database/case_templates/openfoam_channel_les_axper/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100000;

deltaT          <var DELTAT var>;

writeControl    timeStep;

writeInterval   <var WRITEINTERVAL var>;

purgeWrite      <var PURGEWRITE var>;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  <var ADUSTABLETIMESTEP var>;

maxCo           <var MAX_CFL var>;

libs (
"libfieldFunctionObjects.so"
"libsampling.so"
);

functions
{
    <opt INOUT_FIELDAVE_PROBING opt>
    <opt XSCLICE_PROBING opt>
    <opt SLICE_PROBING opt>
    <opt STREAMLINE_PROBING opt>

	yPlus
	{
		type		    yPlus;
		writeControl	writeTime;
        startTime       <var AVE_START var>;
	}
}

    turbulenceFields1
    {
        type            turbulenceFields;
        libs            ("libfieldFunctionObjects.so");
        field		    R;
		writeControl	writeTime;
        startTime       <var AVE_START var>;
    }
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        startTime       <var AVE_START var>;
        fields
        (

            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

}

// ************************************************************************* //
